#+TITLE: TODO backend implementation using CL and fukamachi/ningle

** Examples
  
   #+BEGIN_SRC lisp :tangle no :noweb yes :exports both :results verbatim
     <<example-setup>>
     (with-fresh-todos ()
       (new-todo '(("title" . "get groceries")))
       (new-todo '(("title" . "write-better-documentation")))
       (fset:convert 'list (todos)))
   #+END_SRC
  
   #+RESULTS:
   : (#<hash-table "url": "http://localhost:5000/todo/22",
   :               "title": "get groceries",
   :               "completed": YASON:FALSE>
   :  #<hash-table "url": "http://localhost:5000/todo/23",
   :               "title": "write-better-documentation",
   :               "completed": YASON:FALSE>)
  
   
** Routing utilities

   The core utility here is the =defroutes= macro.  This takes a
   sequence of endpoint descriptions which contain nested definitions
   for HTTP verbs and expands to ningle's functions for manipulating
   routes.

   #+NAME: defroutes
   #+BEGIN_SRC lisp
     (defmacro defroutes (app &body routes)
       (alexandria:once-only (app)
         `(setf
           ,@(loop for (target . descriptors) in routes
                   append (loop for (method callback) in descriptors
                                append `((ningle:route ,app ,target
                                                       :method method)
                                         ,callback))))))
   #+END_SRC
   
   This macro organizes all the HTTP verbs for a given endpoint under
   the path to that endpoint. A more complete version might allow for
   a list of verbs =(:GET :POST)= in the head of each handler clause.
   
   #+BEGIN_SRC lisp :exports both :tangle no :results verbatim
     (macroexpand-1
      '(defroutes app
        ("/"
         (:GET (handler () (todos)))
         (:POST (handler (v) (new-todo v)))
         (:DELETE (handler () (clear-todos))))))
   #+END_SRC
   

   #+RESULTS:
   #+begin_example
   (LET ((#:APP1852 APP))
     (SETF (NINGLE/APP:ROUTE #:APP1852 "/" :METHOD METHOD)
             (HANDLER NIL
               (TODOS))
           (NINGLE/APP:ROUTE #:APP1852 "/" :METHOD METHOD)
             (HANDLER (V)
               (NEW-TODO V))
           (NINGLE/APP:ROUTE #:APP1852 "/" :METHOD METHOD)
             (HANDLER NIL
               (CLEAR-TODOS))))
   T
   #+end_example
   
   Finally, there are some simple helpers to handle some of the
   boilerplate in a clack webserver.  Of particular interest is the
   =handler= macro, which (since this is a json-only API) makes sure
   that all the API results get JSON encoded.

   #+NAME: routing-helpers
   #+BEGIN_SRC lisp
     (defun success (value)
       (list 200 '(:conent-type "application/json") value))

     (defmacro handler ((&optional (sym (gensym "PARAMS"))) &body body)
       `(lambda (,sym)
          (declare (ignorable ,sym))
          (success
           (fwoar.lack.json.middleware:wrap-result
            (progn ,@body)))))
   #+END_SRC
   
